<?php

return [
  'abouttypes' => [
        'datatable' => [
            'created_at' => 'تاريخ الآنشاء',
            'date_range' => 'البحث بالتواريخ',
            'options' => 'الخيارات',
            'status' => 'الحالة',
            'title' => 'العنوان',
        ],
        'form' => [
            'desc'          => 'الوصف',
            'image'         => 'الصورة',
            'restore'       => 'استرجاع من الحذف',
            'status'        => 'الحالة',
            'order'         => 'الترتيب',
            'tabs' => [
                'general' => 'بيانات عامة',
            ],
            'title' => 'عنوان الصفحة',
        ],
        'routes' => [
            'create' => 'اضافة انواع اجزاء عن الرائد',
            'index' => ' انواع اجزاء عن الرائد',
            'update' => 'تعديل انواع اجزاء عن الرائد',
        ],

    ],
  'abouts' => [
        'datatable' => [
            'created_at' => 'تاريخ الآنشاء',
            'date_range' => 'البحث بالتواريخ',
            'options' => 'الخيارات',
            'status' => 'الحالة',
            'image' => 'الصوره',
            'title' => 'العنوان',
        ],
        'form' => [
            'desc'     => 'الوصف',
            'image'           => 'الصورة',
            'restore' => 'استرجاع من الحذف',
            'status' => 'الحالة',
            'link' => 'الرابط',
            'abouttypes' => 'نوع المحتوي',
            'tabs' => [
                'general' => 'بيانات عامة',
            ],
            'title' => 'عنوان الصفحة',
        ],
        'routes' => [
            'create' => 'اضافة  اجزاء عن الرائد',
            'index' => '  اجزاء عن الرائد',
            'update' => 'تعديل  اجزاء عن الرائد',
        ],

    ],
];
